IDENTIFICATION DIVISION.
PROGRAM-ID.  ShortestProgram.

DATA DIVISION.

WORKING-STORAGE SECTION.
77 TECLA                    PIC X.
77 CODIGO-TECLA             PIC 99.
PROCEDURE DIVISION.

DisplayPrompt.
    DISPLAY "Press a key".
    PERFORM LEER-TECLA.
    MOVE TECLA TO CODIGO-TECLA.
    DISPLAY "CODIGO-TECLA = ", CODIGO-TECLA.
    DISPLAY "TECLA = ", TECLA.
    STOP RUN.


LEER-TECLA.
      ACCEPT TECLA
           ON EXCEPTION GO TO EX.
EX.
      MOVE TECLA TO CODIGO-TECLA.
           DISPLAY "Error bye".    