       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       DATA DIVISION.
        WORKING-STORAGE SECTION.
        77 TECLA                    PIC X.

       PROCEDURE DIVISION.
        INICIO.
          DISPLAY TECLA
          GO TO LEER-TECLA.

       LEER-TECLA.
          ACCEPT TECLA AT LINE NUMBER 2
              ON EXCEPTION GO TO INICIO.
      