IDENTIFICATION DIVISION.
PROGRAM-ID.  SeqWrite.


ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT UserFile ASSIGN TO "USERS.DAT"
		ORGANIZATION IS INDEXED
        ACCESS MODE IS DYNAMIC
        RECORD KEY IS USER-TARJ
        FILE STATUS IS FSU.


    SELECT LoginFile ASSIGN TO  "LOGIN.DAT"
       ORGANIZATION IS INDEXED
       ACCESS MODE IS DYNAMIC
       RECORD KEY IS LOGIN-TARJ
       FILE STATUS IS FSL.

DATA DIVISION.
FILE SECTION.
FD USERFILE.
01 REG-USUARIO.
   02 USER-TARJ             PIC 9(10).
   02 USER-PIN              PIC 9(4).
   02 USER-SALDO            PIC 9(9)V99.
   02 USER-DNI              PIC X(9).
   02 USER-NOM-APE          PIC X(30).
   02 USER-TFNO             PIC X(9).
   02 USER-DIRECCION        PIC X(25).
   02 USER-BLOQUEADA        PIC X.
   02 USER-NUM-CUENTA         PIC X(20).

FD LOGINFILE.
 01 REG-LOGIN.
   02 LOGIN-TARJ             PIC 9(10).
   02 LOGIN-NUM-INTENTOS     PIC 9.

WORKING-STORAGE SECTION.
01  FSU     PIC X(2).
01  FSL     PIC X(2).

PROCEDURE DIVISION.
    
INICIO.
*>      PERFORM WRITE-LOGINFILE.
      PERFORM WRITE-USERSFILE.
      STOP RUN.      
      

WRITE-LOGINFILE.
    OPEN OUTPUT LoginFile.
       MOVE 1234567890 TO LOGIN-TARJ.
       MOVE 0 TO LOGIN-NUM-INTENTOS.
       DISPLAY REG-LOGIN.
       WRITE REG-LOGIN
       END-WRITE.
     CLOSE LoginFile.       



WRITE-USERSFILE.
    OPEN OUTPUT UserFile.
       MOVE 1234567890 TO USER-TARJ.
       MOVE 1234 TO USER-PIN.
       MOVE 123123123 TO USER-SALDO.
       MOVE "17461858F" TO USER-DNI.
       MOVE "Alberto Perez Blasco" TO USER-NOM-APE.
       MOVE "456123789" TO USER-TFNO.
       MOVE "ÑKAJSFÑLKLKJDL" TO USER-DIRECCION.
       MOVE "0" TO USER-BLOQUEADA.
       MOVE "WEPOFJWOIWEJ3902309" TO USER-NUM-CUENTA
       DISPLAY REG-USUARIO.
       WRITE REG-USUARIO
       END-WRITE.
     CLOSE UserFile.       
       

  